## Importing Libraries

In [3]:
import pandas as pd

## Create Dataframe

In [5]:
# create dataframe
data = pd.DataFrame({"Month": ['January', 'Feburary', 'March', 'April'], 
                     "Day": [1, 14, 3, 29],
                     "Year": [1901, 1939, 1962, 1956]})

In [6]:
data

      Month  Day  Year
0   January    1  1901
1  Feburary   14  1939
2     March    3  1962
3     April   29  1956

**apply() Function**

In [8]:
# define function
def get_decade(row):
        decade = (row['Year']//10) * 10 # return the first 3 numbers x 10
        return str(decade)[2:] + "s" # return the last 2 digits with an 's'

# create new column & apply function
data['Decade'] = data.apply(get_decade, axis=1)

data

      Month  Day  Year Decade
0   January    1  1901    00s
1  Feburary   14  1939    30s
2     March    3  1962    60s
3     April   29  1956    50s

**Lambda Function**

In [10]:
# use lambda function to achieve same result
decade_lambda = lambda x: (x//10) * 10
decade_lambda(data['Year'])

0    1900
1    1930
2    1960
3    1950
Name: Year, dtype: int64

In [11]:
# create new column for it
data['Decade 2'] = decade_lambda(data['Year'])

data

      Month  Day  Year Decade  Decade 2
0   January    1  1901    00s      1900
1  Feburary   14  1939    30s      1930
2     March    3  1962    60s      1960
3     April   29  1956    50s      1950

**Using Lambda with apply()**

In [13]:
data['Decade 3'] = data['Year'].apply(lambda x: (x//10) * 10)

data

      Month  Day  Year Decade  Decade 2  Decade 3
0   January    1  1901    00s      1900      1900
1  Feburary   14  1939    30s      1930      1930
2     March    3  1962    60s      1960      1960
3     April   29  1956    50s      1950      1950

**Create a Label Column**

Set the labels as:  
- If Decade < 1950: early  
- If Decade == 1950: mid  
- If Decade > 1950: late

In [16]:
data['Decade Label'] = data['Decade 2'].apply(
    lambda x: 'late' if x > 1950 else ('early' if x < 1950
else 'mid'))

data

      Month  Day  Year Decade  Decade 2  Decade 3 Decade Label
0   January    1  1901    00s      1900      1900        early
1  Feburary   14  1939    30s      1930      1930        early
2     March    3  1962    60s      1960      1960         late
3     April   29  1956    50s      1950      1950          mid